scenario/scenario.yml
config:
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Warm up the application 5 user for 30s"

  payload:
    path: "../data/user.csv"
    fields:
      - "email"
  environments:
    dev:
      target: "http://api.dev"
    prod:
      target: "http://api.prod"
scenarios:
  - name: "Candidat deja inscrit"
    flow:
      - post:
          url: "/candilibV2/api/v2/auth/candidat/magic-link"
          json:
            email: "{{ email }}"